/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//
//           画素の直接並び替え処理クラス[Struct定義]
//
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#ifndef INC_UT_PIXELCONVERTER_STRUCT_H//まだ読み込まれていなければ以下の処理をする
#define INC_UT_PIXELCONVERTER_STRUCT_H//「画素の直接並び替え処理クラス用-[Struct定義]」読み込みフラグ

#include "../../Include.h"							//全ファイルでInclude可能なソースまとめファイル
#include "../Constant.h"							//ユーティリティクラスの定数定義ファイル

namespace AppStdLib{
namespace Utility{

using namespace std;		//「string」の名前空間「std」を指定
using namespace Const;		//Utility定数の名前空間「Const」を指定

//*************************************************************************************************************************************************************
//★引数指定用構造体
//*************************************************************************************************************************************************************
struct UTRGB   { uint8_t  Red;      uint8_t  Green;   uint8_t  Blue;                       };//RGBピクセルカラー指定用構造体
struct UTRGBA  { uint8_t  Red;      uint8_t  Green;   uint8_t  Blue;  uint8_t  Alpha;      };//RGBAピクセルカラー指定用構造体
struct UTARGB  { uint8_t  Alpha;    uint8_t  Red;     uint8_t  Green; uint8_t  Blue;       };//ARGBピクセルカラー指定用構造体
struct UTBGR   { uint8_t  Blue;     uint8_t  Green;   uint8_t  Red;                        };//BGRピクセルカラー指定用構造体
struct UTBGRA  { uint8_t  Blue;     uint8_t  Green;   uint8_t  Red;   uint8_t  Alpha;      };//BGRAピクセルカラー指定用構造体
struct UTXRGB  { uint8_t  Reserved; uint8_t  Red;     uint8_t  Green; uint8_t  Blue;       };//XRGBピクセルカラー指定用構造体
struct UTXRGB15{ uint16_t Blue:5;   uint16_t Green:5; uint16_t Red:5; uint16_t Reserved:1; };//XRGB15ピクセルカラー指定用構造体
//*************************************************************************************************************************************************************

}}
#endif//INC_UT_PIXELCONVERTER_STRUCT_H
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
